type Question = {
  question: string;
  answer: string;
};

export const questionDataNoLogin: Record<string, Array<Question>> = {
  "〜参加申請関連〜": [
    {
      question: "参加説明会は両日参加しなければなりませんか？",
      answer: "参加説明会は両日とも同じ内容となっておりますので、どちらかご都合のいい日にご参加ください。",
    },
    {
      question: "出店の団体名と企画名の違いはなんですか？",
      answer: "団体名は申請していただく団体そのものの名称であり、企画名は工大祭当日に実施する企画の名称です。",
    },
    {
      question: "参加申請を出した時点で参加が確定したことになるのでしょうか？",
      answer: "参加申請後、当委員会側にて内容審査を行い、その審査を通過した企画のみ参加が確定されます。",
    },
    {
      question: "一度参加申請を提出しましたが、参加を取り消したいです。",
      answer: "当委員会での企画内容審査終了後に、別途「参加取り下げ期間」を設けておりますので、そちらをご利用ください。",
    },
    {
      question: "各参加団体総会の所要時間はどれくらいですか？",
      answer: "第一回、第三回は最大1時間程度、第二回は最大30分程度を予定しております。",
    },
    {
      question: "参加団体総会には誰が出席しなければなりませんか？",
      answer: "第一回、第三回については、全企画団体で責任者1名以上の出席が必要です。第二回については、事前安全講習会を受講される方全員に出席していただく必要があります。",
    },
    {
      question: "事前安全講習会には誰が出席しなければなりませんか？",
      answer: "模擬店企画団体は責任者3名全員、一般企画団体は責任者の方1名以上の出席が必要です。なお、ステージ企画団体は出席の必要はございません。",
    },
    {
      question: "責任者は何をする必要がありますか？",
      answer: "企画形態により異なりますが、各参加団体総会および事前安全講習会に必要人数（Ｑ5・Ｑ6参照）で出席していただく必要がございます。加えて、模擬店企画については、工大祭当日に事前安全講習会を受講した責任者が最低1名、区画に常駐する必要がございます。",
    },
    {
      question: "参加申請時に記入した団体名、企画名は、後日変更できますか？",
      answer: "企画名は後日変更可能ですが、団体名については本申請以降の変更は原則として受け付けておりません。あらかじめご了承ください。",
    },
    {
      question: "参加申請時に記入した食品の取り扱いについての内容は、後日変更できますか？",
      answer: "変更は可能ですが、保健所への提出書類作成の都合上、変更期限は模擬店向け面談実施日までとなります。それ以降の変更は原則受け付けておりませんのでご了承ください。また、申請内容の大幅な変更はできる限りお控えください。なお、仕入れ先の変更については特に期限は設けておりませんので、ご希望の場合は当委員会までご相談ください。",
    },
    {
      question: "同じ団体で複数の区分の企画に参加申請する場合、責任者の兼任は出来ますか？",
      answer: "基本的に責任者の兼任は認めておりませんが、事情により認可できる場合もございます。ご希望の場合は事前に当委員会までご相談ください。",
    },
    {
      question: "事前安全講習会に出席できない場合責任者になることはできませんか？",
      answer: "後日、事前安全講習会の代替講義を実施いたしますので、そちらに出席いただければ問題ありません。ただし、原則として事前安全講習会に出席できる方を責任者として推奨しております。",
    },
    {
      question: "東京科学大学 医歯学系(旧東京医科歯科大学)の学生でも工大祭に参加できますか？",
      answer: "東京科学大学の学生であれば、どなたでも参加可能です。",
    },
  ],
};