import Link from "next/link";

export const topPageData = {
  booth: [
    [
      {
        title: "STEP 1",
        children: <>
          参加説明会に出席！<br/>
          説明会は5/14(水)と5/16(金)に実施<br/>
          資料は<Link href={""}>こちら</Link>から
        </>
      },
      {
        title: "STEP 2",
        children: <>
          参加申請をしよう！<br/>
          申請期間は5/14(水)から6/18(水)まで<br/>
          参加申請のフォームは<Link href={""}>こちら</Link>
        </>
      },
      {
        title: "STEP 3",
        children: <>
          参加申請完了！<br/>
          工大祭実行委員会からの<br/>
          申請結果通知を待とう！
        </>
      }
    ],
    [
      {
        title: "参加申込金振り込み",
        date: "～7/8(火)",
        children: <>
          6/30の参加資格通知または7/6までの補欠合格発表で合格の通知があった団体の方は7/8までに参加申込金を振り込んでください。
        </>
      },
      {
        title: "第一回参加団体総会",
        date: "7/16(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。<br/>
          資料は[こちら]()から
        </>
      },
      {
        title: "各種申請を行う",
        children: <>
          食品の取り扱い、電源、レンタル品の申請を行なっていただきます。<br/>
          詳しくは第一回参加団体総会にてご説明します。
        </>
      },
      {
        title: "模擬店企画向け面談",
        date: "8/18(月) 8/20(水) 8/22(金) 8/25(月)",
        children: <>
          申請内容の最終確認と修正をしていただきます。
          模擬店申請らくらくパックを利用する団体は来ていただく必要はございません。
        </>
      },
      {
        title: "事前安全講習会",
        date: "9/24(水)",
        children: <>
          責任者3名に出席していただく必要がございます。<br/>
          資料は[こちら]()から
        </>
      },
      {
        title: "第二回参加団体総会",
        date: "10/8(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。<br/>
          資料は[こちら]()から
        </>
      },
      {
        title: "工大祭に出店する",
        children: <>
          楽しみましょう！
        </>
      }
    ]
  ],
  general: [
    [
      {
        title: "STEP 1",
        children: <>
          参加説明会に出席！<br/>
          説明会は5/14(水)と5/16(金)に実施<br/>
          資料は<Link href={""}>こちら</Link>から
        </>
      },
      {
        title: "STEP 2",
        children: <>
          参加申請をしよう！<br/>
          申請期間は5/14(水)から6/18(水)まで<br/>
          参加申請のフォームは<Link href={""}>こちら</Link>
        </>
      },
      {
        title: "STEP 3",
        children: <>
          参加申請完了！<br/>
          工大祭実行委員会からの<br/>
          申請結果通知を待とう！
        </>
      }
    ],
    [
      {
        title: "参加申込金振り込み",
        date: "～7/8(火)",
        children: <>
          6/30の参加資格通知または7/6までの補欠合格発表で合格の通知があった団体の方は7/8までに参加申込金を振り込んでください。
        </>
      },
      {
        title: "一般企画場所決定会",
        date: "7/9(水)",
        children: <>
          希望場所が重複している場合、7/6(日)までに通知いたしますので、ご出席ください。
        </>
      },
      {
        title: "第一回参加団体総会",
        date: "7/16(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。
          資料は<a>こちら</a>から
        </>
      },
      {
        title: "各種申請を行う",
        children: <>
          物品や電源などの申請を行なっていただきます。<br/>
          詳しくは第一回参加団体総会にてご説明します。
        </>
      },
      {
        title: "事前安全講習会",
        date: "9/24(水)",
        children: <>
          責任者のうち1名に出席していただく必要がございます。
          資料は<a>こちら</a>から
        </>
      },
      {
        title: "第二回参加団体総会",
        date: "10/8(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。<br/>
          資料は<a>こちら</a>から
        </>
      },
      {
        title: "工大祭に出展する",
        children: <>
          楽しみましょう！
        </>
      }
    ]
  ],
  stage: [
    [
      {
        title: "STEP 1",
        children: <>
          参加説明会に出席！<br/>
          説明会は5/14(水)と5/16(金)に実施<br/>
          資料は<Link href={""}>こちら</Link>から
        </>
      },
      {
        title: "STEP 2",
        children: <>
          参加申請をしよう！<br/>
          申請期間は5/14(水)から6/18(水)まで<br/>
          参加申請のフォームは<Link href={""}>こちら</Link>
        </>
      },
      {
        title: "STEP 3",
        children: <>
          参加申請完了！<br/>
          工大祭実行委員会からの<br/>
          申請結果通知を待とう！
        </>
      }
    ],
    [
      {
        title: "企画内容決定会",
        date: "7/9(水)",
        children: <>
          タイムテーブルを決定しますので、ご出席ください。
          (野外ステージのみに参加する団体は参加される必要はございません。)
        </>
      },
      {
        title: "参加申込金振り込み",
        date: "～7/15(火)",
        children: <>
          6/30の参加資格通知または7/6までの補欠合格発表で合格の通知があった団体の方は7/15までに参加申込金を振り込んでください。
        </>
      },
      {
        title: "第一回参加団体総会",
        date: "7/16(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。<br/>
          資料は<a>こちら</a>から
        </>
      },
      {
        title: "各種申請を行う",
        children: <>
          物品などの申請を行なっていただきます。<br/>
          詳しくは第一回参加団体総会にてご説明します。
        </>
      },
      {
        title: "第二回参加団体総会",
        date: "10/8(水)",
        children: <>
          全団体に出席義務があり、責任者のうち少なくとも1名の出席が必要です。
          資料は<a>こちら</a>から
        </>
      },
      {
        title: "工大祭に出展する",
        children: <>
          楽しみましょう！
        </>
      }
    ]
  ],
  labo: [
    [
      {
        title: "参加申請を行う",
        date: "5/7(水)13:00～6/18(水)",
        children: <>
          資料は<a>こちら</a>！<br/>
          参加申請フォームは<a>こちら</a>
        </>
      },
      {
        title: "第一回資料配布",
        date: "7/2(水)",
        children: <>
          当委員会が資料をお渡しに伺います。<br/>
          ご不在の場合はポストに投函させていただきます。
        </>
      },
      {
        title: "パンフレット原稿",
        date: "7/2(水)～7/31(木)",
        children: <>
          工大祭のパンフレットに記載する情報を提出していただきます。
        </>
      },
      {
        title: "各種申請をする",
        children: <>
          該当する研究室のかたのみ、必要な申請をしていただきます。
        </>
      },
      {
        title: "第二回資料配布",
        date: "10/15(水)",
        children: <>
          当委員会が資料をお渡しに伺います。<br/>
          ご不在の場合はポストに投函させていただきます。
        </>
      },
      {
        title: "工大祭本番！",
        date: "11/2(日)、11/3(月・祝)",
        children: <>
          楽しみましょう！
        </>
      }
    ]
  ]
}


type Document = {
  title: string,
  url: string,
}
export const documentDataNoLogin: Record<string, Array<Document>> = {
  "研究室公開企画": [
    {
      title: "工大祭2025研究室公開企画 参加要項",
      url: "/privacy_policy.pdf"
    },
    {
      title: "研究室向け模擬店企画参加のご案内",
      url: "/privacy_policy.pdf"
    },
    {
      title: "パンフレット掲載例",
      url: "/privacy_policy.pdf"
    }
  ],
  "プライバシーポリシー": [
    {
      title: "個人情報保護方針（参加団体・研究室）",
      url: "/privacy_policy.pdf"
    },
    {
      title: "団体情報保護方針（参加団体・研究室）",
      url: "/privacy_policy.pdf"
    }
  ],
  "工大祭2025公式ロゴ配布": [
    {
      title: "工大祭2025研究室公開企画 参加要項",
      url: "/privacy_policy.pdf"
    },
    {
      title: "研究室向け模擬店企画参加のご案内",
      url: "/privacy_policy.pdf"
    },
    {
      title: "パンフレット掲載例",
      url: "/privacy_policy.pdf"
    }
  ],
  "工大祭2025参加説明会": [
    {
      title: "工大祭2025研究室公開企画 参加要項",
      url: "/privacy_policy.pdf"
    },
    {
      title: "研究室向け模擬店企画参加のご案内",
      url: "/privacy_policy.pdf"
    },
    {
      title: "パンフレット掲載例",
      url: "/privacy_policy.pdf"
    }
  ]
}